{
  "metadata": {
    "total_size": 7256607680
  },
  "weight_map": {
    "model.embed_tokens.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.audio_projection.speech.0.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.audio_projection.speech.0.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.audio_projection.speech.2.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.audio_projection.speech.2.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.audio_projection.vision.0.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.audio_projection.vision.0.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.audio_projection.vision.2.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.audio_projection.vision.2.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.embed.conv.0.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.embed.conv.0.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.embed.conv.2.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.embed.conv.2.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.embed.conv.3.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.embed.conv.3.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.embed.conv.5.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.embed.conv.5.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.embed.conv.6.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.embed.conv.6.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.embed.out.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.embed.out.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoder_embedding.global_invstd": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoder_embedding.global_mean": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.0.conv.dw_sep_conv_1d.dw_conv.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.0.conv.dw_sep_conv_1d.dw_conv.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.0.conv.dw_sep_conv_1d.pw_conv.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.0.conv.dw_sep_conv_1d.pw_conv.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.0.conv.ext_pw_conv_1d.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.0.conv.ext_pw_conv_1d.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.0.conv.glu.b1": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.0.conv.glu.b2": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.0.conv.glu.ext_pw_conv_1d.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.0.conv.glu.ext_pw_conv_1d.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.0.conv.layer_norm.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.0.conv.layer_norm.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.0.feed_forward_in.layer_norm.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.0.feed_forward_in.layer_norm.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.0.feed_forward_in.net.0.linear.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.0.feed_forward_in.net.0.linear.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.0.feed_forward_in.net.2.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.0.feed_forward_in.net.2.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.0.feed_forward_out.layer_norm.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.0.feed_forward_out.layer_norm.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.0.feed_forward_out.net.0.linear.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.0.feed_forward_out.net.0.linear.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.0.feed_forward_out.net.2.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.0.feed_forward_out.net.2.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.0.layer_norm.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.0.layer_norm.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.0.layer_norm_att.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.0.layer_norm_att.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.0.self_attn.linear_k.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.0.self_attn.linear_k.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.0.self_attn.linear_out.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.0.self_attn.linear_out.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.0.self_attn.linear_q.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.0.self_attn.linear_q.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.0.self_attn.linear_v.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.0.self_attn.linear_v.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.1.conv.dw_sep_conv_1d.dw_conv.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.1.conv.dw_sep_conv_1d.dw_conv.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.1.conv.dw_sep_conv_1d.pw_conv.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.1.conv.dw_sep_conv_1d.pw_conv.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.1.conv.ext_pw_conv_1d.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.1.conv.ext_pw_conv_1d.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.1.conv.glu.b1": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.1.conv.glu.b2": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.1.conv.glu.ext_pw_conv_1d.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.1.conv.glu.ext_pw_conv_1d.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.1.conv.layer_norm.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.1.conv.layer_norm.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.1.feed_forward_in.layer_norm.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.1.feed_forward_in.layer_norm.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.1.feed_forward_in.net.0.linear.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.1.feed_forward_in.net.0.linear.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.1.feed_forward_in.net.2.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.1.feed_forward_in.net.2.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.1.feed_forward_out.layer_norm.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.1.feed_forward_out.layer_norm.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.1.feed_forward_out.net.0.linear.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.1.feed_forward_out.net.0.linear.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.1.feed_forward_out.net.2.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.1.feed_forward_out.net.2.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.1.layer_norm.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.1.layer_norm.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.1.layer_norm_att.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.1.layer_norm_att.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.1.self_attn.linear_k.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.1.self_attn.linear_k.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.1.self_attn.linear_out.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.1.self_attn.linear_out.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.1.self_attn.linear_q.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.1.self_attn.linear_q.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.1.self_attn.linear_v.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.1.self_attn.linear_v.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.10.conv.dw_sep_conv_1d.dw_conv.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.10.conv.dw_sep_conv_1d.dw_conv.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.10.conv.dw_sep_conv_1d.pw_conv.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.10.conv.dw_sep_conv_1d.pw_conv.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.10.conv.ext_pw_conv_1d.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.10.conv.ext_pw_conv_1d.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.10.conv.glu.b1": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.10.conv.glu.b2": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.10.conv.glu.ext_pw_conv_1d.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.10.conv.glu.ext_pw_conv_1d.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.10.conv.layer_norm.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.10.conv.layer_norm.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.10.feed_forward_in.layer_norm.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.10.feed_forward_in.layer_norm.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.10.feed_forward_in.net.0.linear.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.10.feed_forward_in.net.0.linear.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.10.feed_forward_in.net.2.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.10.feed_forward_in.net.2.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.10.feed_forward_out.layer_norm.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.10.feed_forward_out.layer_norm.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.10.feed_forward_out.net.0.linear.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.10.feed_forward_out.net.0.linear.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.10.feed_forward_out.net.2.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.10.feed_forward_out.net.2.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.10.layer_norm.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.10.layer_norm.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.10.layer_norm_att.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.10.layer_norm_att.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.10.self_attn.linear_k.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.10.self_attn.linear_k.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.10.self_attn.linear_out.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.10.self_attn.linear_out.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.10.self_attn.linear_q.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.10.self_attn.linear_q.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.10.self_attn.linear_v.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.10.self_attn.linear_v.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.11.conv.dw_sep_conv_1d.dw_conv.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.11.conv.dw_sep_conv_1d.dw_conv.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.11.conv.dw_sep_conv_1d.pw_conv.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.11.conv.dw_sep_conv_1d.pw_conv.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.11.conv.ext_pw_conv_1d.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.11.conv.ext_pw_conv_1d.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.11.conv.glu.b1": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.11.conv.glu.b2": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.11.conv.glu.ext_pw_conv_1d.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.11.conv.glu.ext_pw_conv_1d.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.11.conv.layer_norm.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.11.conv.layer_norm.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.11.feed_forward_in.layer_norm.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.11.feed_forward_in.layer_norm.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.11.feed_forward_in.net.0.linear.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.11.feed_forward_in.net.0.linear.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.11.feed_forward_in.net.2.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.11.feed_forward_in.net.2.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.11.feed_forward_out.layer_norm.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.11.feed_forward_out.layer_norm.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.11.feed_forward_out.net.0.linear.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.11.feed_forward_out.net.0.linear.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.11.feed_forward_out.net.2.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.11.feed_forward_out.net.2.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.11.layer_norm.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.11.layer_norm.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.11.layer_norm_att.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.11.layer_norm_att.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.11.self_attn.linear_k.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.11.self_attn.linear_k.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.11.self_attn.linear_out.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.11.self_attn.linear_out.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.11.self_attn.linear_q.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.11.self_attn.linear_q.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.11.self_attn.linear_v.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.11.self_attn.linear_v.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.12.conv.dw_sep_conv_1d.dw_conv.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.12.conv.dw_sep_conv_1d.dw_conv.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.12.conv.dw_sep_conv_1d.pw_conv.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.12.conv.dw_sep_conv_1d.pw_conv.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.12.conv.ext_pw_conv_1d.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.12.conv.ext_pw_conv_1d.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.12.conv.glu.b1": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.12.conv.glu.b2": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.12.conv.glu.ext_pw_conv_1d.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.12.conv.glu.ext_pw_conv_1d.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.12.conv.layer_norm.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.12.conv.layer_norm.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.12.feed_forward_in.layer_norm.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.12.feed_forward_in.layer_norm.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.12.feed_forward_in.net.0.linear.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.12.feed_forward_in.net.0.linear.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.12.feed_forward_in.net.2.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.12.feed_forward_in.net.2.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.12.feed_forward_out.layer_norm.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.12.feed_forward_out.layer_norm.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.12.feed_forward_out.net.0.linear.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.12.feed_forward_out.net.0.linear.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.12.feed_forward_out.net.2.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.12.feed_forward_out.net.2.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.12.layer_norm.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.12.layer_norm.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.12.layer_norm_att.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.12.layer_norm_att.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.12.self_attn.linear_k.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.12.self_attn.linear_k.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.12.self_attn.linear_out.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.12.self_attn.linear_out.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.12.self_attn.linear_q.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.12.self_attn.linear_q.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.12.self_attn.linear_v.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.12.self_attn.linear_v.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.13.conv.dw_sep_conv_1d.dw_conv.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.13.conv.dw_sep_conv_1d.dw_conv.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.13.conv.dw_sep_conv_1d.pw_conv.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.13.conv.dw_sep_conv_1d.pw_conv.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.13.conv.ext_pw_conv_1d.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.13.conv.ext_pw_conv_1d.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.13.conv.glu.b1": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.13.conv.glu.b2": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.13.conv.glu.ext_pw_conv_1d.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.13.conv.glu.ext_pw_conv_1d.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.13.conv.layer_norm.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.13.conv.layer_norm.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.13.feed_forward_in.layer_norm.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.13.feed_forward_in.layer_norm.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.13.feed_forward_in.net.0.linear.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.13.feed_forward_in.net.0.linear.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.13.feed_forward_in.net.2.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.13.feed_forward_in.net.2.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.13.feed_forward_out.layer_norm.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.13.feed_forward_out.layer_norm.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.13.feed_forward_out.net.0.linear.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.13.feed_forward_out.net.0.linear.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.13.feed_forward_out.net.2.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.13.feed_forward_out.net.2.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.13.layer_norm.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.13.layer_norm.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.13.layer_norm_att.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.13.layer_norm_att.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.13.self_attn.linear_k.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.13.self_attn.linear_k.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.13.self_attn.linear_out.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.13.self_attn.linear_out.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.13.self_attn.linear_q.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.13.self_attn.linear_q.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.13.self_attn.linear_v.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.13.self_attn.linear_v.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.14.conv.dw_sep_conv_1d.dw_conv.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.14.conv.dw_sep_conv_1d.dw_conv.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.14.conv.dw_sep_conv_1d.pw_conv.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.14.conv.dw_sep_conv_1d.pw_conv.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.14.conv.ext_pw_conv_1d.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.14.conv.ext_pw_conv_1d.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.14.conv.glu.b1": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.14.conv.glu.b2": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.14.conv.glu.ext_pw_conv_1d.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.14.conv.glu.ext_pw_conv_1d.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.14.conv.layer_norm.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.14.conv.layer_norm.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.14.feed_forward_in.layer_norm.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.14.feed_forward_in.layer_norm.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.14.feed_forward_in.net.0.linear.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.14.feed_forward_in.net.0.linear.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.14.feed_forward_in.net.2.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.14.feed_forward_in.net.2.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.14.feed_forward_out.layer_norm.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.14.feed_forward_out.layer_norm.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.14.feed_forward_out.net.0.linear.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.14.feed_forward_out.net.0.linear.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.14.feed_forward_out.net.2.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.14.feed_forward_out.net.2.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.14.layer_norm.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.14.layer_norm.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.14.layer_norm_att.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.14.layer_norm_att.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.14.self_attn.linear_k.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.14.self_attn.linear_k.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.14.self_attn.linear_out.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.14.self_attn.linear_out.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.14.self_attn.linear_q.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.14.self_attn.linear_q.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.14.self_attn.linear_v.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.14.self_attn.linear_v.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.15.conv.dw_sep_conv_1d.dw_conv.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.15.conv.dw_sep_conv_1d.dw_conv.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.15.conv.dw_sep_conv_1d.pw_conv.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.15.conv.dw_sep_conv_1d.pw_conv.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.15.conv.ext_pw_conv_1d.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.15.conv.ext_pw_conv_1d.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.15.conv.glu.b1": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.15.conv.glu.b2": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.15.conv.glu.ext_pw_conv_1d.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.15.conv.glu.ext_pw_conv_1d.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.15.conv.layer_norm.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.15.conv.layer_norm.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.15.feed_forward_in.layer_norm.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.15.feed_forward_in.layer_norm.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.15.feed_forward_in.net.0.linear.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.15.feed_forward_in.net.0.linear.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.15.feed_forward_in.net.2.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.15.feed_forward_in.net.2.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.15.feed_forward_out.layer_norm.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.15.feed_forward_out.layer_norm.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.15.feed_forward_out.net.0.linear.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.15.feed_forward_out.net.0.linear.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.15.feed_forward_out.net.2.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.15.feed_forward_out.net.2.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.15.layer_norm.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.15.layer_norm.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.15.layer_norm_att.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.15.layer_norm_att.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.15.self_attn.linear_k.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.15.self_attn.linear_k.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.15.self_attn.linear_out.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.15.self_attn.linear_out.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.15.self_attn.linear_q.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.15.self_attn.linear_q.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.15.self_attn.linear_v.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.15.self_attn.linear_v.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.16.conv.dw_sep_conv_1d.dw_conv.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.16.conv.dw_sep_conv_1d.dw_conv.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.16.conv.dw_sep_conv_1d.pw_conv.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.16.conv.dw_sep_conv_1d.pw_conv.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.16.conv.ext_pw_conv_1d.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.16.conv.ext_pw_conv_1d.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.16.conv.glu.b1": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.16.conv.glu.b2": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.16.conv.glu.ext_pw_conv_1d.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.16.conv.glu.ext_pw_conv_1d.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.16.conv.layer_norm.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.16.conv.layer_norm.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.16.feed_forward_in.layer_norm.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.16.feed_forward_in.layer_norm.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.16.feed_forward_in.net.0.linear.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.16.feed_forward_in.net.0.linear.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.16.feed_forward_in.net.2.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.16.feed_forward_in.net.2.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.16.feed_forward_out.layer_norm.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.16.feed_forward_out.layer_norm.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.16.feed_forward_out.net.0.linear.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.16.feed_forward_out.net.0.linear.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.16.feed_forward_out.net.2.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.16.feed_forward_out.net.2.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.16.layer_norm.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.16.layer_norm.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.16.layer_norm_att.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.16.layer_norm_att.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.16.self_attn.linear_k.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.16.self_attn.linear_k.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.16.self_attn.linear_out.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.16.self_attn.linear_out.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.16.self_attn.linear_q.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.16.self_attn.linear_q.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.16.self_attn.linear_v.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.16.self_attn.linear_v.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.17.conv.dw_sep_conv_1d.dw_conv.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.17.conv.dw_sep_conv_1d.dw_conv.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.17.conv.dw_sep_conv_1d.pw_conv.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.17.conv.dw_sep_conv_1d.pw_conv.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.17.conv.ext_pw_conv_1d.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.17.conv.ext_pw_conv_1d.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.17.conv.glu.b1": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.17.conv.glu.b2": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.17.conv.glu.ext_pw_conv_1d.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.17.conv.glu.ext_pw_conv_1d.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.17.conv.layer_norm.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.17.conv.layer_norm.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.17.feed_forward_in.layer_norm.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.17.feed_forward_in.layer_norm.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.17.feed_forward_in.net.0.linear.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.17.feed_forward_in.net.0.linear.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.17.feed_forward_in.net.2.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.17.feed_forward_in.net.2.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.17.feed_forward_out.layer_norm.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.17.feed_forward_out.layer_norm.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.17.feed_forward_out.net.0.linear.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.17.feed_forward_out.net.0.linear.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.17.feed_forward_out.net.2.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.17.feed_forward_out.net.2.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.17.layer_norm.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.17.layer_norm.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.17.layer_norm_att.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.17.layer_norm_att.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.17.self_attn.linear_k.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.17.self_attn.linear_k.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.17.self_attn.linear_out.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.17.self_attn.linear_out.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.17.self_attn.linear_q.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.17.self_attn.linear_q.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.17.self_attn.linear_v.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.17.self_attn.linear_v.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.18.conv.dw_sep_conv_1d.dw_conv.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.18.conv.dw_sep_conv_1d.dw_conv.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.18.conv.dw_sep_conv_1d.pw_conv.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.18.conv.dw_sep_conv_1d.pw_conv.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.18.conv.ext_pw_conv_1d.bias": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.18.conv.ext_pw_conv_1d.weight": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.18.conv.glu.b1": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.18.conv.glu.b2": "model-00001-of-00002.safetensors",
    "model.embed_tokens_extend.audio_embed.encoder.encoders.18.conv.glu.ext_pw_conv_1d.bias": "model-00001-of-00002.safetensors",
