{
    "architectures": [
        "Qwen3MoeForCausalLM"
    ],
    "attention_bias": false,
    "attention_dropout": 0.0,
    "bos_token_id": 151643,
    "decoder_sparse_step": 1,
    "eos_token_id": 151645,
    "head_dim": 128,
    "hidden_act": "silu",
    "hidden_size": 2048,
    "initializer_range": 0.02,
    "intermediate_size": 6144,
    "max_position_embeddings": 40960,
    "max_window_layers": 48,
    "mlp_only_layers": [],
    "model_type": "qwen3_moe",
    "moe_intermediate_size": 768,
    "norm_topk_prob": true,
    "num_attention_heads": 32,
    "num_experts": 128,
    "num_experts_per_tok": 8,
    "num_hidden_layers": 48,
    "num_key_value_heads": 4,
    "output_router_logits": false,
    "rms_norm_eps": 1e-06,
    "rope_scaling": null,
    "rope_theta": 1000000.0,
    "router_aux_loss_coef": 0.001,
    "sliding_window": null,
    "tie_word_embeddings": false,
    "torch_dtype": "bfloat16",
    "transformers_version": "4.53.1",
    "use_cache": true,
    "use_sliding_window": false,
    "vocab_size": 151936,
    "quantization_config": {
        "config_groups": {
            "group_0": {
                "input_activations": {
                    "dynamic": false,
                    "num_bits": 4,
                    "type": "float",
                    "group_size": 16
                },
                "weights": {
                    "dynamic": false,
                    "num_bits": 4,
                    "type": "float",
                    "group_size": 16
                },
                "targets": [
                    "Linear"
                ]
            }
        },
        "ignore": [
            "model.layers.0.mlp.gate",
            "model.layers.1.mlp.gate",
            "model.layers.10.mlp.gate",
            "model.layers.11.mlp.gate",
            "model.layers.12.mlp.gate",
            "model.layers.13.mlp.gate",
            "model.layers.14.mlp.gate",
            "model.layers.15.mlp.gate",
            "model.layers.16.mlp.gate",
            "model.layers.17.mlp.gate",
            "model.layers.18.mlp.gate",
            "model.layers.19.mlp.gate",
            "model.layers.2.mlp.gate",
            "model.layers.20.mlp.gate",
            "model.layers.21.mlp.gate",
            "model.layers.22.mlp.gate",
            "model.layers.23.mlp.gate",
            "model.layers.24.mlp.gate",
            "model.layers.25.mlp.gate",
            "model.layers.26.mlp.gate",
            "model.layers.27.mlp.gate",
            "model.layers.28.mlp.gate",
            "model.layers.29.mlp.gate",
            "model.layers.3.mlp.gate",
            "model.layers.30.mlp.gate",
            "model.layers.31.mlp.gate",
            "model.layers.32.mlp.gate",
            "model.layers.33.mlp.gate",
            "model.layers.34.mlp.gate",
            "model.layers.35.mlp.gate",
            "model.layers.36.mlp.gate",
            "model.layers.37.mlp.gate",
            "model.layers.38.mlp.gate",
            "model.layers.39.mlp.gate",
            "model.layers.4.mlp.gate",
            "model.layers.40.mlp.gate",
            "model.layers.41.mlp.gate",
            "model.layers.42.mlp.gate",
            "model.layers.43.mlp.gate",
            "model.layers.44.mlp.gate",
            "model.layers.45.mlp.gate",
            "model.layers.46.mlp.gate",
            "model.layers.47.mlp.gate",
            "model.layers.5.mlp.gate",
            "model.layers.6.mlp.gate",
            "model.layers.7.mlp.gate",
            "model.layers.8.mlp.gate",
            "model.layers.9.mlp.gate",
            "lm_head"
        ],
        "quant_algo": "NVFP4",
        "kv_cache_scheme": {
            "dynamic": false,
            "num_bits": 8,
            "type": "float"
        },
        "producer": {
            "name": "modelopt",
            "version": "0.34.1.dev85+g7a72957d"
        },
        "quant_method": "modelopt"
    }
}